
　　在我成为预备党员的一年中，无论是学习，工作还是生活都磨练和教育了我，觉得自我的思想境界和进取分子转预备党员时候都有了些许提高，一方面我想是自我不断的努力和进取，但另一方面也没有忘记自我心中存在党的信仰对我的精神上的时刻影响。下面我就从思想政治学习、工作方面简短的概括一下这几个月的的个人情况。
   1.思想政治学习方面
　 自从成为预备党员以来，我更加注重党的政治理论知识的深入学习，除了重新学习党章和党的相关精神以外，我还充分利用时间，看时政新闻，学习党的重要报告，关注国家大事和时事政治。经过反复学习，我的政策理论水平有了显著提高。经过学习，我重温了党的基本理论知识，对党的路线方针政策有了更深的理解和把握。对于党的性质、宗旨的认识更加深入，大局观念和党性进一步增强，全心全意为人民服务的思想更加牢固，自身政治素质和思想觉悟有了较大的提高。我深知，要成为一名合格的共产党员，不仅仅要有正确的理论知识，更要勇于去实践。要活学活用，把先进的思想化做先进的生产力和先进的创造力，把党的思想同实际工作和生活紧密联系起来。
  2.工作方面
   成为预备党员以来，我更加严格的要求自己。首先是继续严守上下班制度，决不迟到早退！其次，加强业务方面的学习，通过持续性的业务学习，我掌握了如何快速查证电信诈骗案件中的关键线索和证据，有效的提升打击电信诈骗等新型犯罪的效率和能力！此外，我将自身的专业优势与工作结合起来，通过自己开发小程序来提高工资效率，提升工作的精度和准度！作为一个共产党员的人民警察，只有不断地加强业务学习，苦练本领，提升技能，才能能好的履职尽责，打击犯罪，服务人民！
  
　　中国共产党是我国国家的领导核心，而我们预备党员首先应当做的不断的学习进取提升自己，这样才能在这样的优秀团体中发挥我们的力量，为社会做出更大的贡献。在今后的日子里，我会继续认真学习党的理论知识，不断提高自我理论联系实际的本事，并且继续以党员的要求严格要求自我。我相信经过我的不断努力，我能够到达一名合格的党员的要求。
  
  
  
  三、不足之处
  <span>、政治理论基础不够扎实，理论联系实际的潜力较差；</span>
  <span>、对队里的各项要求和规定能认真执行，但用心性不太高；</span>
  <span>　　在今后的工作和学习中，自我要更进一步严格要求自我，虚心向先进的党员同志学习，注意克服自我的缺点和不足，争取在思想、工作、学习等方面有更大的进步。</span>
  
  
  
  
  
  
　　今年我成为了一名中共正式党员，这给了无限的信心的同时也有更多的压力。时刻提醒着我注意，什么是一个党员该做的，什么是不该做的，更促进了我的进步。我深刻而清楚地认识到自己的缺点和不足，并在生活中循序渐进地改善，一个人改正错误和缺点的过程我想不会再一朝一夕。所以我做好了充分的心理准备。尤其，在组织生活会上，同志们再次提出了我的不足之处，这使我感到自己还有很多路要走还有很多是要学，当然自己的努力是少不了的。我有信心明年总结的时候可以完全改正一些不足和缺点。因为我是一名党员了，就应该拿出吃苦耐劳的精神，如果连自己的缺点都不能克服还谈什么先锋模范作用。这一年里，我积极响应学校组织的多次党员活动，配合当前的理论前沿，为自己补充新鲜
